fix: remove unicode
